# 4.6 Combining & Exporting Data

## Contents list:

### Exercise 4.6; Steps

### 01. Importing libraries
### 02. Importing data
### 03. Merging dataframes
### 04. Exporting data

# Exercise 4.6

### 01. Importing libraries

In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os

### 02. Importing data

In [3]:
# Project folder path as string
path = r'C:\Users\User\Desktop\Instacart Basket Analysis'

In [4]:
# Import order_products__prior.csv data set using the os library
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'order_products__prior.csv'), index_col=False)

In [5]:
# Import orders_checked.csv data set using the os library
df_ords= pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'), index_col = False)

In [6]:
# Check the output
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [7]:
# Check the output
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,1,2,8,NaN
1,1,1,2398795,1,2,3,7,15.0
2,2,2,473747,1,3,3,12,21.0
3,3,3,2254736,1,4,4,7,29.0
4,4,4,431534,1,5,4,15,28.0

In [8]:
# Check the shape
df_ords_prior.shape

(32434489, 4)

In [9]:
# Check the shape
df_ords.shape

(3421083, 8)

In [10]:
# Dropping the Unnamed:0 and Unnamed:01 columns from df_ords dataframe
df_ords=df_ords.drop(columns = ['Unnamed: 0', 'Unnamed: 0.1'])

### 03. Merging dataframes

In [11]:
# Merging dataframes 
df_merged_large=df_ords.merge(df_ords_prior, on = 'order_id', indicator=True)

In [12]:
# Check the output
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [13]:
# Merge flag frequency
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

### 04. Exporting data

In [14]:
# Exporting the df_merged_large dataframe in pickle format as 'orders_products_combined.pkl'
df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))